Tekla.Structures.DirectManipulation.Adapter.Controls.PopupToolBarPanel
The Tekla.Structures.DirectManipulation.Adapter.Controls.PopupToolBarPanel class wraps and represents any instance of Tekla.BIM.DirectManipulation.Services.Controls.IControlsGroup.

Tekla.Structures.DirectManipulation.Adapter.Controls.PopupToolBarPanel.dataSource
The data source for the current toolbar.

Tekla.Structures.DirectManipulation.Adapter.Controls.PopupToolBarPanel.factory
The toolbar control factory.

Tekla.Structures.DirectManipulation.Adapter.Controls.PopupToolBarPanel.#ctor(Tekla.BIM.DirectManipulation.Services.Controls.IControlsGroup)
Initializes a new instance of the Tekla.Structures.DirectManipulation.Adapter.Controls.PopupToolBarPanel class.
dataSource: The data source of the toolbar.

Tekla.Structures.DirectManipulation.Adapter.Controls.PopupToolBarPanel.ControlClicked
Occurs when any control is clicked.

Tekla.Structures.DirectManipulation.Adapter.Controls.PopupToolBarPanel.ControlCursorHover
Occurs when any control is hovered.

Tekla.Structures.DirectManipulation.Adapter.Controls.PopupToolBarPanel.ControlStateChanged
Occurs when any control is changed.

Tekla.Structures.DirectManipulation.Adapter.Controls.PopupToolBarPanel.ControlGotKeyboardFocus
Occurs when control got keyboard focus.

Tekla.Structures.DirectManipulation.Adapter.Controls.PopupToolBarPanel.ControlLostKeyboardFocus
Occurs when the control lost keyboard focus.

Tekla.Structures.DirectManipulation.Adapter.Controls.PopupToolBarPanel.Disposed
Occurs when the toolbar is disposed.

Tekla.Structures.DirectManipulation.Adapter.Controls.PopupToolBarPanel.Identifier
Gets the toolbar identifier.

Tekla.Structures.DirectManipulation.Adapter.Controls.PopupToolBarPanel.Type
Gets the toolbar type.

Tekla.Structures.DirectManipulation.Adapter.Controls.PopupToolBarPanel.SupportedTargetTypes
Gets the supported target types.

Tekla.Structures.DirectManipulation.Adapter.Controls.PopupToolBarPanel.Update(Tekla.BIM.DirectManipulation.Services.Controls.IControlsGroup)
Updates the appearance of the items representing the given group.
updatedGroup: The updated group.

Tekla.Structures.DirectManipulation.Adapter.Controls.PopupToolBarPanel.UpdateSingleControl(Tekla.BIM.DirectManipulation.Services.Controls.ControlBase,Tekla.BIM.DirectManipulation.Services.Controls.ControlShortState)
Updates the appearance of the item representing the given control.
updatedControl: The updated control.
shortState: The Tekla.BIM.DirectManipulation.Services.Controls.ControlShortState to apply on updatedControl as a short lived state.

Tekla.Structures.DirectManipulation.Adapter.Controls.PopupToolBarPanel.Dispose
Performs the cleanup when the toolbar is disposed.

Tekla.Structures.DirectManipulation.Adapter.Controls.PopupToolBarPanel.RaiseEventHandler(Tekla.BIM.DirectManipulation.Services.Controls.ControlEventHandler,System.Windows.Controls.Control)
Raises the given eventHandler.
eventHandler: The event handler to call.
sender: The sender of the event.
Returns: True on success; otherwise, false.

Tekla.Structures.DirectManipulation.Adapter.Controls.PopupToolBarPanel.InitializeComponent
Initializes all contents of the form.

Tekla.Structures.DirectManipulation.Adapter.Controls.PopupToolBarPanel.InitializeToolBar
Initializes the tool bar items.

Tekla.Structures.DirectManipulation.Adapter.Controls.PopupToolBarPanel.UpdateSingleControl(System.Windows.FrameworkElement,Tekla.BIM.DirectManipulation.Services.Controls.ControlBase,Tekla.BIM.DirectManipulation.Services.Controls.ControlShortState)
Updates the appearance of the item representing the given control.
updatedControl: The updated control.
data: The control data.
shortState: The Tekla.BIM.DirectManipulation.Services.Controls.ControlShortState to apply on updatedControl as a short lived state.
Returns: True on success; otherwise, false.

Tekla.Structures.DirectManipulation.Adapter.Controls.PopupToolBarPanel.OnItemClicked(System.Object,System.EventArgs)
Handles the clicked event for any of the child controls.
sender:
The sender of the event, expected to be of type System.Windows.Controls.Control
and to have a value specified for Control.Tag.
eventArgs: The arguments of the event.

Tekla.Structures.DirectManipulation.Adapter.Controls.PopupToolBarPanel.OnItemMouseHover(System.Object,System.EventArgs)
Handles the hover event for any of the child controls.
sender:
The sender of the event, expected to be of type System.Windows.Controls.Control
and to have a value specified for Control.Tag.
eventArgs: The arguments of the event.

Tekla.Structures.DirectManipulation.Adapter.Controls.PopupToolBarPanel.OnGotKeyboardFocus(System.Object,System.EventArgs)
Handles the got keyboard focus event.
sender:
The sender of the event, expected to be of type System.Windows.Controls.Control
and to have a value specified for Control.Tag.
eventArgs: The arguments of the event.

Tekla.Structures.DirectManipulation.Adapter.Controls.PopupToolBarPanel.OnLostKeyboardFocus(System.Object,System.EventArgs)
Handles the lost keyboard focus event.
sender:
The sender of the event, expected to be of type System.Windows.Controls.Control
and to have a value specified for Control.Tag.
eventArgs: The arguments of the event.

Tekla.Structures.DirectManipulation.Adapter.Controls.PopupToolBarPanel.OnItemStateChanged(System.Object,System.EventArgs)
Handles the changed event for any of the child controls.
sender:
The sender of the event, expected to be of type System.Windows.Controls.Control
and to have a value specified for Control.Tag.
eventArgs: The arguments of the event.